geCalculatePlane(OdGeCurve3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsConst*,System.Boolean!System.Runtime.CompilerServices.IsConst*,System.UInt32!System.Runtime.CompilerServices.IsLong,OdGePlane*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Returns the plane defined by the specified points.
\param curves [in]  Array of 3D curves.
\param reverseFlags [in]  Array of reverse flags.
\param numCurves [in]  Number of curves.
\param plane [out]  Receives the calculated plane.
\param tol [in]  Geometric tolerance.
\param validateCoplanar [in]  Check whether curves/points are coplanar (set false only if curves/points are complanar).
\returns
Possible return values are as follows:
@untitled table
kOk
kNonCoplanarGeometry
kDegenerateGeometry
kSingularPoint
\remarks
Supported curves are OdGeCircArc3d, OdGeEllipArc3d, OdGeNurbCurve3d, and OdGeLineSeg3d.
Corresponding C++ library: TD_Ge

geCalculatePlane(OdGeCurve3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsConst*,System.UInt32!System.Runtime.CompilerServices.IsLong,OdGePlane*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Returns the plane defined by the specified points.
\param curves [in]  Array of 3D curves.
\param numCurves [in]  Number of curves.
\param plane [out]  Receives the calculated plane.
\param tol [in]  Geometric tolerance.
\param validateCoplanar [in]  Check whether curves/points are coplanar (set false only if curves/points are complanar).
\returns
Possible return values are as follows:
@untitled table
kOk
kNonCoplanarGeometry
kDegenerateGeometry
kSingularPoint
\remarks
Supported curves are OdGeCircArc3d, OdGeEllipArc3d, OdGeNurbCurve3d, and OdGeLineSeg3d.
Corresponding C++ library: TD_Ge

geCalculatePlane(OdGePoint3d!System.Runtime.CompilerServices.IsConst*,System.UInt32!System.Runtime.CompilerServices.IsLong,OdGePlane*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Returns the plane defined by the specified points.
\param points [in]  Array of 3D points.
\param numPoints [in]  Number of points.
\param plane [out]  Receives the calculated plane.
\param tol [in]  Geometric tolerance.
\param validateCoplanar [in]  Check whether curves/points are coplanar (set false only if curves/points are complanar).
\returns
Possible return values are as follows:
@untitled table
kOk
kNonCoplanarGeometry
kDegenerateGeometry
kSingularPoint
Corresponding C++ library: TD_Ge

geCalculatePlane(OdArray&lt;OdGePoint3d,OdMemoryAllocator&lt;OdGePoint3d&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePlane*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Returns the plane defined by the specified points.
\param points [in]  Array of 3D points.
\param plane [out]  Receives the calculated plane.
\param tol [in]  Geometric tolerance.
\param validateCoplanar [in]  Check whether curves/points are coplanar (set false only if curves/points are coplanar).
\returns
Possible return values are as follows:
@untitled table
kOk
kNonCoplanarGeometry
kDegenerateGeometry
kSingularPoint
Corresponding C++ library: TD_Ge